foam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Nodes-Top;
    patches           (flapTop);
    locations         faceNodes;
    
    readData
    (
      Displacement-Top
    );
    
    writeData
    (
    );
  };
  Interface2
  {
    mesh              Fluid-Mesh-Centers-Top;
    patches           (flapTop);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Force-Top
    );
  };
  Interface3
  {
    mesh              Fluid-Mesh-Nodes-Bottom;
    patches           (flapBottom);
    locations         faceNodes;
    
    readData
    (
      Displacement-Bottom
    );
    
    writeData
    (
    );
  };
  Interface4
  {
    mesh              Fluid-Mesh-Centers-Bottom;
    patches           (flapBottom);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Force-Bottom
    );
  };
  Interface5
  {
    mesh              Fluid-Mesh-Nodes-Side;
    patches           (flapSide);
    locations         faceNodes;
    
    readData
    (
      Displacement-Side
    );
    
    writeData
    (
    );
  };
  Interface6
  {
    mesh              Fluid-Mesh-Centers-Side;
    patches           (flapSide);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Force-Side
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1.205;
}
