foam/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
     {
       name    fsiFacesTop;
       type    faceSet;
       action  new;
       source  patchToFace;
       sourceInfo
       {
         name flapTop;
       }
     }
     {
       name    fsiFacesBottom;
       type    faceSet;
       action  new;
       source  patchToFace;
       sourceInfo
       {
         name  flapBottom;
       }
     }
     {
       name    fsiFacesSide;
       type    faceSet;
       action  new;
       source  patchToFace;
       sourceInfo
       {
         name flapSide;
       }
     }
);

// ************************************************************************* //
